XMegaForArduino/arduino/variants/cc0_atxmega_e5/pins_arduino.h
// xmega 'E' series has 2 sets of UART and SPI.
// The default UART is assigned on Port D, pins PD2-3
// The default SPI is assigned on Port C, pins PC4-7
//
// There is only ONE TWI on the 'E' series, on port C pins 0,1
//
// Standard (un-shifted) GPIO pins are assigned as follows:
// PD0-7 Digital 0-7
// PC0-7 Digital 8-15
// PR0-1 digital 16-17
// PA0-7 analog A0-A7
//
// '#define'ing DIGITAL_IO_PIN_SHIFT shifts this down by 2, and places PC0-1 on 16-17
// and PD0-1 on 6-7. This is for Arduino 'atmega' compatibility with respect to existing shields,
// so that you don't have to re-map pin numbers with #defines in existing software that hard-codes
// them or makes assumptions about pin numbers vs functionality.  On Rev 3 you can map TWI to
// the additional 2 SDA/SCL pins (see below), though they won't map to A4 and A5 like the Uno.
//
// ALL PORT REMAP registers must be assigned to 0 (default mappings for pins) except when explicitly
// remapping something (like the serial ports, see below).
// Additionally, CLKOUT should be 0 (no clock outputs on any port/pin).
//
// TIMERS
// Timer 0 should be configured as 'Tx2' (for 8 PWM outputs) by default, essentially
// as a dual 8-bit timer, more or less compatible with the Arduino's 3 timers and
// supporting all 8 pins on ports C and D for PWM output.  Port C's timer supports
// the system clock, so don't use it for 'Tone'.
//
// See 'D' manual chapter 13 for more on this


// --------------------------------------------
// DEFINITIONS FOR SERIAL PORTS AND DEFAULT TWI
// --------------------------------------------

#define DEFAULT_TWI TWIC
#define TWIC_VECT_ENABLE /* use this to select the correct interrupt vectors */

// serial port 0
#define SERIAL_0_PORT_NAME PORTD
#define SERIAL_0_USART_NAME USARTD0
#define SERIAL_0_USART_DATA USARTD0_DATA
#define SERIAL_0_RXC_ISR ISR(USARTD0_RXC_vect)
#define SERIAL_0_DRE_ISR ISR(USARTD0_DRE_vect)
#define SERIAL_0_REMAP PORTD_REMAP         /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 0 */
#define SERIAL_0_REMAP_BIT PORT_USART0_bm  /* the bitmask needed to remap the port if SERIAL_0_REMAP is defined */
#define SERIAL_0_RX_PIN_INDEX 6 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_0_TX_PIN_INDEX 7 /* the pin number on the port, not the mapped digital pin number */
#define USARTD0_VECTOR_EXISTS

// serial port 1
#define SERIAL_1_PORT_NAME PORTC
#define SERIAL_1_USART_NAME USARTC0
#define SERIAL_1_USART_DATA USARTC0_DATA
#define SERIAL_1_RXC_ISR ISR(USARTC0_RXC_vect)
#define SERIAL_1_DRE_ISR ISR(USARTC0_DRE_vect)
//#define SERIAL_1_REMAP PORTC_REMAP        /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 1 */
//#define SERIAL_1_REMAP_BIT PORT_USART0_bm /* the bit needed to remap the port if SERIAL_1_REMAP is defined */
#define SERIAL_1_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_1_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */
#define USARTC0_VECTOR_EXISTS


// PIN SHIFTING FOR PWM OUT ON PORT D
// normal I/O is on pins 4, 5, 6, 7 - but 6 and 7 are in use by the serial port, so I must shift them
//
#define TCD5_PIN_SHIFT 0xc /* 1100b PD4 PD5 PD2 PD3 - see sect 12.13.13 */


// TWI is on TWIC (port C pins 0/1)

// This layout describes the 'cc0 atxmega32e5 breakout board'
// https://www.tindie.com/products/andete/atxmega32e5-breakout-board/
// 
//     
//     
//                     V G             R T V G
//     A A A A A A A A C N             X X C N
//     0 1 2 3 4 5 6 7 C D             D D C D
//   --o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-o-
//     P P P P P P P P     P P P P P P P P
//     A A A A A A A A     D D D D D D D D
//     0 1 2 3 4 5 6 7     0 1 2 3 4 5 6 7
//                                           o - GND
//               T O P   V I E W             o - CTS
//                                           o - VCC
//         P P P P P P P P  G P P R P V      o - TXO (PD7)
//         C C C C C C C C  N R R S D C      o - RXI (PD6)
//         7 6 5 4 3 2 1 0  D 1 0 T I C      o - DTR
//   --o-o-o-o-o-o-o-o-o-o--o-o-o-o-o-o--------
//     G V S M M S T R S S
//     N C C I O S X X C D
//     D C K S S   C C L A
//           O I
//
// with shifted pin assignments, digital 0 through 17 are as follows:
// PD6, PD7, PD4, PD5, PD2, PD3, PD0, PD1, PC2, PC3, PC4, PC5, PC6, PC7, PR0, PR1, PC0, PC1
//
// As with the MEGA2560 and other 'mega' Arduino boards, additional connectors would
// break out the additional pins, with appropriate labeling.  Additionally, there should
// be an LED on PORTR pin 1 for 'LED_BUILTIN'.
//
// This layout is based on the 'Rev 3' Arduino.
//
// NOTE - NO AREF:  AREF is not connected.  AREF is a bit of an issue on xmega because
// it DOES! NOT! WORK! THE! SAME! as it does on the ATmegaXXX and so you would need to
// (literally) steal one of the additional analog input pins to implement it. It's not
// impossible, or even THAT difficult.  I'm just not doing it here.
//



#ifdef DIGITAL_IO_PIN_SHIFT /* aka digital I/O pin 0 is PORTD pin 2, and PORTD 0-1 and PORTC 0-1 are re-mapped for Arduino shield compatibility */

// SHIFTED I/O pins (atmega compatibility) - see xmega mod description in comment at top

// default SPI
static const uint8_t SS   = 10;
static const uint8_t MOSI = 11;
static const uint8_t MISO = 12;
static const uint8_t SCK  = 13;

// primary SPI on PC4-7
static const uint8_t SS0   = 10;
static const uint8_t MOSI0 = 11;
static const uint8_t MISO0 = 12;
static const uint8_t SCK0  = 13;

// secondary SPI on PD4-7
static const uint8_t SS1   = 2;
static const uint8_t MOSI1 = 3;
static const uint8_t MISO1 = 4;
static const uint8_t SCK1  = 5;

// default 2-wire on PC0,PC1 - TWIC
static const uint8_t SDA = 16;
static const uint8_t SCL = 17;

// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6 etc.
#define PR0 14
#define PR1 15

#else // no digital I/O pin shifting, PORTD pin 0 is digital I/O pin 0 (as it should be)

