XMegaForArduino/arduino/variants/cc0_atxmega_e5/pins_arduino.h
// default "no shift" pin assignments

// default SPI
static const uint8_t SS   = 12;
static const uint8_t MOSI = 13;
static const uint8_t MISO = 14;
static const uint8_t SCK  = 15;

// primary SPI on PC4-7
static const uint8_t SS0   = 12;
static const uint8_t MOSI0 = 13;
static const uint8_t MISO0 = 14;
static const uint8_t SCK0  = 15;

// secondary SPI on PD4-7
static const uint8_t SS1   = 4;
static const uint8_t MOSI1 = 5;
static const uint8_t MISO1 = 6;
static const uint8_t SCK1  = 7;

// default 2-wire on PC0,PC1 - TWIC
static const uint8_t SDA = 8;
static const uint8_t SCL = 9;

// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6 etc.
#define PR0 16
#define PR1 17

#endif // DIGITAL_IO_PIN_SHIFT


// default 'status' LED on PR1
//static const uint8_t LED_BUILTIN = PR1;
#define LED_BUILTIN PR1 /* Arduino 1.06 uses #define, not a const uint8_t */

static const uint8_t A0 = 18;
static const uint8_t A1 = 19;
static const uint8_t A2 = 20;
static const uint8_t A3 = 21;
static const uint8_t A4 = 22;
static const uint8_t A5 = 23;
static const uint8_t A6 = 24;
static const uint8_t A7 = 25;

// on the xmega 'E' series, PA2, PC2, and PD2 are asynchronous ints.  Others are 'synchronous' which means
// that they must be held in their 'interrupt state' long enough for the system to detect them.  In any case
// all digital input pins can be use as interrupts, synchronous or otherwise.


#ifdef ARDUINO_MAIN

// TODO:  modify 'core' code to have different indices for E series?  For now it's ok as-is

const uint16_t PROGMEM port_to_mode_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_DIR,       // PA
  NOT_A_PORT,                  // 2  [E series has no 'port B'
  (uint16_t) &PORTC_DIR,       // PC
  (uint16_t) &PORTD_DIR,       // PD
  NOT_A_PORT,                  // 5  [E series has no 'port E'
  (uint16_t) &PORTR_DIR,       // PR
};

const uint16_t PROGMEM port_to_output_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_OUT,       // PA
  NOT_A_PORT,                  // 2  [E series has no 'port B'
  (uint16_t) &PORTC_OUT,       // PC
  (uint16_t) &PORTD_OUT,       // PD
  NOT_A_PORT,                  // 5  [E series has no 'port E'
  (uint16_t) &PORTR_OUT,       // PR
};

const uint16_t PROGMEM port_to_input_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_IN,        // PA
  NOT_A_PORT,                  // 2  [E series has no 'port B'
  (uint16_t) &PORTC_IN,        // PC
  (uint16_t) &PORTD_IN,        // PD
  NOT_A_PORT,                  // 5  [E series has no 'port E'
  (uint16_t) &PORTR_IN,        // PR
};

// xmega has a per-pin config register as well.  Normally these will be 00000111 for analog, 00000000 for digital 'totem pole'
// for 'INPUT_PULLUP' these will be 00011111
//   bits 2:0 (trigger)  000 both edges  001 rising  010 falling  011 level  111 input buffer disabled
//            note:  'input buffer disabled' required to use the 'IN' register (so default here)
//                   also port R does not support 'INTPUT_DISABLED' (sic) so use BOTHEDGES [0] instead
//   bits 5:3 (out/pull) 000 TOTEM [normal], 001 bus keeper [sticky], 010 pulldown, 011 pullup,
//                       100 wired 'or', 101 wired 'and', 110 wired 'or' pulldown, 111 wired 'and' pullup
//   bit 6:  "invert logic" (0 = normal, 1 = inverted)
//   bit 7:  unused, must be zero
// NOTE:  PORTA through PORTE (PORTF?) support 'input buffer disabled' and this setting is recommended
//        for analog inputs.  PORTR apparently does NOT support this (set to zero?)

const uint16_t PROGMEM digital_pin_to_control_PGM[] = {
#ifndef DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** 0 **
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT

// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
#ifdef DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTD_PIN6CTRL,  // PD 6 ** 2 ** USARTD_RX
  (uint16_t) &PORTD_PIN7CTRL,  // PD 7 ** 3 ** USARTD_TX
#else // no pin shifting
  (uint16_t) &PORTD_PIN2CTRL,  // PD 2 ** 2 ** USARTD_RX ASYNC
  (uint16_t) &PORTD_PIN3CTRL,  // PD 3 ** 3 ** USARTD_TX
#endif // DIGITAL_IO_PIN_SHIFT

  (uint16_t) &PORTD_PIN4CTRL,  // PD 4 ** 4 **
  (uint16_t) &PORTD_PIN5CTRL,  // PD 5 ** 5 **

#ifdef DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTD_PIN2CTRL,  // PD 2 ** 6 ** ASYNC
  (uint16_t) &PORTD_PIN3CTRL,  // PD 3 ** 7 **
#else // no pin shifting
  (uint16_t) &PORTD_PIN6CTRL,  // PD 6 ** 6 **
  (uint16_t) &PORTD_PIN7CTRL,  // PD 7 ** 7 **
#endif // DIGITAL_IO_PIN_SHIFT

#ifdef DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** 8 ** must do this to reserve PC 0 and 1 for SDA/SCL
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** 9 **
#else // no pin shifting
  (uint16_t) &PORTC_PIN0CTRL,  // PC 0 ** 8 ** SDA
  (uint16_t) &PORTC_PIN1CTRL,  // PC 1 ** 9 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTC_PIN2CTRL,  // PC 2 ** 10 **              ASYNC
  (uint16_t) &PORTC_PIN3CTRL,  // PC 3 ** 11 **
  (uint16_t) &PORTC_PIN4CTRL,  // PC 4 ** 12 ** SPI_SS
  (uint16_t) &PORTC_PIN5CTRL,  // PC 5 ** 13 ** SPI_MOSI
  (uint16_t) &PORTC_PIN6CTRL,  // PC 6 ** 14 ** SPI_MISO
  (uint16_t) &PORTC_PIN7CTRL,  // PC 7 ** 15 ** SPI_SCK
  (uint16_t) &PORTR_PIN0CTRL,  // PR 0 ** 16 **
  (uint16_t) &PORTR_PIN1CTRL,  // PR 1 ** 17 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTC_PIN0CTRL,  // PC 0 ** the new 16 ** SDA
  (uint16_t) &PORTC_PIN1CTRL,  // PC 1 ** the new 17 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTA_PIN0CTRL,  // PA 0 ** 22 ** A0
  (uint16_t) &PORTA_PIN1CTRL,  // PA 1 ** 23 ** A1
  (uint16_t) &PORTA_PIN2CTRL,  // PA 2 ** 24 ** A2           ASYNC
  (uint16_t) &PORTA_PIN3CTRL,  // PA 3 ** 25 ** A3
  (uint16_t) &PORTA_PIN4CTRL,  // PA 4 ** 26 ** A4
  (uint16_t) &PORTA_PIN5CTRL,  // PA 5 ** 27 ** A5
  (uint16_t) &PORTA_PIN6CTRL,  // PA 6 ** 28 ** A6
  (uint16_t) &PORTA_PIN7CTRL,  // PA 7 ** 29 ** A7
};

const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
  // PORTLIST
  // -------------------------------------------
#ifndef DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 0 ** 0 **
  _PD,  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT

// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
#ifdef DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 6 ** 2 ** USARTD_RX
  _PD,  // PD 7 ** 3 ** USARTD_TX
#else // no pin shifting
  _PD,  // PD 2 ** 2 ** USARTD_RX ASYNC
  _PD,  // PD 3 ** 3 ** USARTD_TX
#endif // DIGITAL_IO_PIN_SHIFT

  _PD,  // PD 4 ** 4 **
  _PD,  // PD 5 ** 5 **

#ifdef DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 2 ** 6 ** ASYNC
  _PD,  // PD 3 ** 7 **
#else // no pin shifting
  _PD,  // PD 6 ** 6 **
  _PD,  // PD 7 ** 7 **
#endif // DIGITAL_IO_PIN_SHIFT

#ifdef DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 0 ** 8 **
  _PD,  // PD 1 ** 9 **
#else // no pin shifting
  _PC,  // PC 0 ** 8 ** SDA
  _PC,  // PC 1 ** 9 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
  _PC,  // PC 2 ** 10 **
  _PC,  // PC 3 ** 11 **
  _PC,  // PC 4 ** 12 ** SPI_SS
  _PC,  // PC 5 ** 13 ** SPI_MOSI
  _PC,  // PC 6 ** 14 ** SPI_MISO
  _PC,  // PC 7 ** 15 ** SPI_SCK
  _PR,  // PR 0 ** 16 **
  _PR,  // PR 1 ** 17 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  _PC,  // PC 0 ** the new 16 ** SDA
  _PC,  // PC 1 ** the new 17 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
  _PA,  // PA 0 ** 22 ** A0
  _PA,  // PA 1 ** 23 ** A1
  _PA,  // PA 2 ** 24 ** A2
  _PA,  // PA 3 ** 25 ** A3
  _PA,  // PA 4 ** 26 ** A4
  _PA,  // PA 5 ** 27 ** A5
  _PA,  // PA 6 ** 28 ** A6
  _PA,  // PA 7 ** 29 ** A7
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
  // PIN IN PORT
  // -------------------------------------------
#ifndef DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PD 0 ** 0 **
  _BV( 1 ),  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT

// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
#ifdef DIGITAL_IO_PIN_SHIFT
  _BV( 6 ),  // PD 6 ** 2 ** USARTD_RX
  _BV( 7 ),  // PD 7 ** 3 ** USARTD_TX
#else // no pin shifting
  _BV( 2 ),  // PD 2 ** 2 ** USARTD_RX ASYNC
  _BV( 3 ),  // PD 3 ** 3 ** USARTD_TX
#endif // DIGITAL_IO_PIN_SHIFT

  _BV( 4 ),  // PD 4 ** 4 **
  _BV( 5 ),  // PD 5 ** 5 **

#ifdef DIGITAL_IO_PIN_SHIFT
  _BV( 2 ),  // PD 2 ** 6 ** ASYNC
  _BV( 3 ),  // PD 3 ** 7 **
#else // no pin shifting
  _BV( 6 ),  // PD 6 ** 6 **
  _BV( 7 ),  // PD 7 ** 7 **
#endif // DIGITAL_IO_PIN_SHIFT

#ifdef DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PD 0 ** 8 **
  _BV( 1 ),  // PD 1 ** 9 **
#else // no pin shifting
  _BV( 0 ),  // PC 0 ** 8 ** SDA
  _BV( 1 ),  // PC 1 ** 9 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
  _BV( 2 ),  // PC 2 ** 10 **
  _BV( 3 ),  // PC 3 ** 11 **
  _BV( 4 ),  // PC 4 ** 12 ** SPI_SS
  _BV( 5 ),  // PC 5 ** 13 ** SPI_MOSI
  _BV( 6 ),  // PC 6 ** 14 ** SPI_MISO
  _BV( 7 ),  // PC 7 ** 15 ** SPI_SCK
  _BV( 0 ),  // PR 0 ** 16 **
  _BV( 1 ),  // PR 1 ** 17 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PC 0 ** the new 16 ** SDA
  _BV( 1 ),  // PC 1 ** the new 17 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PA 0 ** 22 ** A0
  _BV( 1 ),  // PA 1 ** 23 ** A1
  _BV( 2 ),  // PA 2 ** 24 ** A2
  _BV( 3 ),  // PA 3 ** 25 ** A3
  _BV( 4 ),  // PA 4 ** 26 ** A4
  _BV( 5 ),  // PA 5 ** 27 ** A5
  _BV( 6 ),  // PA 6 ** 28 ** A6
  _BV( 7 ),  // PA 7 ** 29 ** A7
};



const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  // TIMERS
  // -------------------------------------------
  // for now 'NOT_ON_TIMER' for all - later, assign timers based
  // on pins 0-3 being enabled as PWM out for ports A through E
  // corresponding to timers A through D (see D manual sections 11.12.14,
  // also see D manual sect 13.6 for using the 'compare' channel on 'TCx2' to generate
  // a PWM output.  Must select pin as output, _AND_ enable the 'compare' output
  // for the appropriate pin.  LCMPENx/HCMPENx registers to enable it.

